// Задача 54: Задайте двумерный массив. Напишите программу, которая упорядочит по 
// возрастанию элементы каждой строки двумерного массива.

// Например, задан массив:
// 1   4   7   2
// 5   9   2   3
// 8   4   2   4

// В итоге получается вот такой массив:
// 1   2   4   7
// 2   3   5   9
// 2   4   4   8




// Задача 56: Задайте прямоугольный двумерный массив. Напишите программу, 
// которая будет находить строку с наименьшей суммой элементов.
// Например, задан массив:

// 1   4   7   2
// 5   9   2   3
// 8   4   2   4
// 5   2   6   7
// Программа считает сумму элементов в каждой строке и выдаёт номер строки с наименьшей суммой элементов: 1 строка





// Задача 62. Заполните спирально массив 4 на 4.
// Например, на выходе получается вот такой массив:

// 1   2   3   4
// 12  13  14  5
// 11  16  15  6
// 10  9   8   7
